index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-07 Wed 19:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2022 Advent of Code</title>
<meta name="author" content="Philip Cooksey" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">2022 Advent of Code</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org83af4d2">Day 1</a></li>
<li><a href="#org61986c0">Day 2</a></li>
<li><a href="#org9ec507c">Day 3</a></li>
<li><a href="#org58be59c">Day 4</a></li>
<li><a href="#org7ea9b2f">Day 5</a></li>
<li><a href="#org950f911">Day 6</a></li>
<li><a href="#org52e0d26">Day 7</a></li>
</ul>
</div>
</div>

<div id="outline-container-org83af4d2" class="outline-2">
<h2 id="org83af4d2"><a href="https://adventofcode.com/2022/day/1">Day 1</a></h2>
<div class="outline-text-2" id="text-org83af4d2">
</div>
<div id="outline-container-orgce1f05e" class="outline-3">
<h3 id="orgce1f05e">Code</h3>
<div class="outline-text-3" id="text-orgce1f05e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ffac4a;">values</span> = <span style="color: #ab7eff;">[]</span>
<span style="color: #ffac4a;">current_elf</span> = 0
<span style="color: #ffac4a;">current_value</span> = 0
<span style="color: #ff0066;">for</span> line <span style="color: #ff0066;">in</span> data.split<span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">'\n'</span><span style="color: #ab7eff;">)</span>:
  <span style="color: #ff0066;">if</span> line == <span style="color: #E6DB74;">''</span>:
    values.append<span style="color: #ab7eff;">(</span>current_value<span style="color: #ab7eff;">)</span>
    current_elf += 1
    current_value = 0
  <span style="color: #ff0066;">else</span>:
    current_value += <span style="color: #ff0066;">int</span><span style="color: #ab7eff;">(</span>line<span style="color: #ab7eff;">)</span>
values.sort<span style="color: #ab7eff;">()</span>
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>values<span style="color: #06d8ff;">[</span>-1<span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">)</span>  <span style="color: #bebebe;"># </span><span style="color: #bebebe;">: (122, 72478)</span>
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span><span style="color: #ff0066;">sum</span><span style="color: #06d8ff;">(</span>values<span style="color: #63de5d;">[</span>-3:<span style="color: #63de5d;">]</span><span style="color: #06d8ff;">)</span><span style="color: #ab7eff;">)</span>
</pre>
</div>

<pre class="example">
72478
210367
</pre>
</div>
</div>
</div>
