index.html

<div id="outline-container-org61986c0" class="outline-2">
<h2 id="org61986c0"><a href="https://adventofcode.com/2022/day/2">Day 2</a></h2>
<div class="outline-text-2" id="text-org61986c0">
</div>
<div id="outline-container-org9c1e109" class="outline-3">
<h3 id="org9c1e109">Code</h3>
<div class="outline-text-3" id="text-org9c1e109">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ffac4a;">score_map</span> = <span style="color: #ab7eff;">{</span>
    <span style="color: #E6DB74;">'A X'</span>: 1 + 3,
    <span style="color: #E6DB74;">'A Y'</span>: 2 + 6,
    <span style="color: #E6DB74;">'A Z'</span>: 3 + 0,
    <span style="color: #E6DB74;">'B X'</span>: 1 + 0,
    <span style="color: #E6DB74;">'B Y'</span>: 2 + 3,
    <span style="color: #E6DB74;">'B Z'</span>: 3 + 6,
    <span style="color: #E6DB74;">'C X'</span>: 1 + 6,
    <span style="color: #E6DB74;">'C Y'</span>: 2 + 0,
    <span style="color: #E6DB74;">'C Z'</span>: 3 + 3,
<span style="color: #ab7eff;">}</span>
<span style="color: #bebebe;"># </span><span style="color: #bebebe;">X (lose) Y (draw) Z (win)</span>
<span style="color: #ffac4a;">score_remap</span> = <span style="color: #ab7eff;">{</span>
    <span style="color: #E6DB74;">'A'</span>: <span style="color: #06d8ff;">{</span>
        <span style="color: #E6DB74;">'X'</span>: <span style="color: #E6DB74;">'Z'</span>,
        <span style="color: #E6DB74;">'Y'</span>: <span style="color: #E6DB74;">'X'</span>,
        <span style="color: #E6DB74;">'Z'</span>: <span style="color: #E6DB74;">'Y'</span>,
    <span style="color: #06d8ff;">}</span>,
    <span style="color: #E6DB74;">'B'</span>: <span style="color: #06d8ff;">{</span>
        <span style="color: #E6DB74;">'X'</span>: <span style="color: #E6DB74;">'X'</span>,
        <span style="color: #E6DB74;">'Y'</span>: <span style="color: #E6DB74;">'Y'</span>,
        <span style="color: #E6DB74;">'Z'</span>: <span style="color: #E6DB74;">'Z'</span>,
    <span style="color: #06d8ff;">}</span>,
    <span style="color: #E6DB74;">'C'</span>: <span style="color: #06d8ff;">{</span>
        <span style="color: #E6DB74;">'X'</span>: <span style="color: #E6DB74;">'Y'</span>,
        <span style="color: #E6DB74;">'Y'</span>: <span style="color: #E6DB74;">'Z'</span>,
        <span style="color: #E6DB74;">'Z'</span>: <span style="color: #E6DB74;">'X'</span>,
    <span style="color: #06d8ff;">}</span>
<span style="color: #ab7eff;">}</span>
<span style="color: #ffac4a;">score_part_1</span> = 0
<span style="color: #ffac4a;">score_part_2</span> = 0
<span style="color: #ff0066;">for</span> line <span style="color: #ff0066;">in</span> data.split<span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">'\n'</span><span style="color: #ab7eff;">)</span>:
    <span style="color: #ffac4a;">score_part_1</span> += score_map<span style="color: #ab7eff;">[</span>line<span style="color: #ab7eff;">]</span>
    <span style="color: #ffac4a;">a</span>, <span style="color: #ffac4a;">b</span> = line.split<span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">' '</span><span style="color: #ab7eff;">)</span>
    <span style="color: #ffac4a;">score_part_2</span> += score_map<span style="color: #ab7eff;">[</span>line<span style="color: #06d8ff;">[</span>:2<span style="color: #06d8ff;">]</span> + score_remap<span style="color: #06d8ff;">[</span>a<span style="color: #06d8ff;">][</span>b<span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">]</span>
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>score_part_1<span style="color: #ab7eff;">)</span>
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>score_part_2<span style="color: #ab7eff;">)</span>
</pre>
</div>

<pre class="example">
8933
11998
</pre>
</div>
</div>
</div>
