index.html
<div id="outline-container-org9ec507c" class="outline-2">
<h2 id="org9ec507c"><a href="https://adventofcode.com/2022/day/3">Day 3</a></h2>
<div class="outline-text-2" id="text-org9ec507c">
</div>
<div id="outline-container-orgec6aafb" class="outline-3">
<h3 id="orgec6aafb">Code</h3>
<div class="outline-text-3" id="text-orgec6aafb">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #bebebe;"># </span><span style="color: #bebebe;">Lowercase item types a through z have priorities 1 through 26.</span>
<span style="color: #bebebe;"># </span><span style="color: #bebebe;">Uppercase item types A through Z have priorities 27 through 52.</span>
<span style="color: #ff0066;">def</span> <span style="color: #63de5d;">priority</span><span style="color: #ab7eff;">(</span>letter<span style="color: #ab7eff;">)</span>:
    <span style="color: #ffac4a;">val</span> = <span style="color: #ff0066;">ord</span><span style="color: #ab7eff;">(</span>letter<span style="color: #ab7eff;">)</span>
    <span style="color: #ff0066;">if</span> letter.islower<span style="color: #ab7eff;">()</span>:
        <span style="color: #ff0066;">return</span> val - <span style="color: #ff0066;">ord</span><span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">'a'</span><span style="color: #ab7eff;">)</span> + 1
    <span style="color: #ff0066;">return</span> val - <span style="color: #ff0066;">ord</span><span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">'A'</span><span style="color: #ab7eff;">)</span> + 27
<span style="color: #ffac4a;">score</span> = 0
<span style="color: #ffac4a;">group_score</span> = 0
<span style="color: #ffac4a;">groups</span> = <span style="color: #ab7eff;">[]</span>
<span style="color: #ff0066;">for</span> line <span style="color: #ff0066;">in</span> data.split<span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">'\n'</span><span style="color: #ab7eff;">)</span>:
    <span style="color: #bebebe;"># </span><span style="color: #bebebe;">Part 1</span>
    <span style="color: #ffac4a;">half</span> = <span style="color: #ff0066;">len</span><span style="color: #ab7eff;">(</span>line<span style="color: #ab7eff;">)</span> / 2
    <span style="color: #ffac4a;">first</span> = <span style="color: #ff0066;">set</span><span style="color: #ab7eff;">(</span>line<span style="color: #06d8ff;">[</span>:half<span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">)</span>
    <span style="color: #ffac4a;">second</span> = <span style="color: #ff0066;">set</span><span style="color: #ab7eff;">(</span>line<span style="color: #06d8ff;">[</span><span style="color: #ffac4a;">half</span>:<span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">)</span>
    score += priority<span style="color: #ab7eff;">(</span>first.intersection<span style="color: #06d8ff;">(</span>second<span style="color: #06d8ff;">)</span>.pop<span style="color: #06d8ff;">()</span><span style="color: #ab7eff;">)</span>
    <span style="color: #bebebe;"># </span><span style="color: #bebebe;">Part 2</span>
    groups.append<span style="color: #ab7eff;">(</span><span style="color: #ff0066;">set</span><span style="color: #06d8ff;">(</span>line<span style="color: #06d8ff;">)</span><span style="color: #ab7eff;">)</span>
<span style="color: #ffac4a;">ijk</span> = <span style="color: #ff0066;">iter</span><span style="color: #ab7eff;">(</span>groups<span style="color: #ab7eff;">)</span>
<span style="color: #ff0066;">for</span> i, j, k <span style="color: #ff0066;">in</span> <span style="color: #ff0066;">zip</span><span style="color: #ab7eff;">(</span>ijk, ijk, ijk<span style="color: #ab7eff;">)</span>:
    <span style="color: #ffac4a;">group_score</span> += priority<span style="color: #ab7eff;">(</span>i.intersection<span style="color: #06d8ff;">(</span>j<span style="color: #06d8ff;">)</span>.intersection<span style="color: #06d8ff;">(</span>k<span style="color: #06d8ff;">)</span>.pop<span style="color: #06d8ff;">()</span><span style="color: #ab7eff;">)</span>
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>score<span style="color: #ab7eff;">)</span>
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>group_score<span style="color: #ab7eff;">)</span>
</pre>
</div>

<pre class="example">
8185
2817
</pre>
</div>
</div>
</div>
