index.html

<div id="outline-container-org58be59c" class="outline-2">
<h2 id="org58be59c"><a href="https://adventofcode.com/2022/day/4">Day 4</a></h2>
<div class="outline-text-2" id="text-org58be59c">
</div>
<div id="outline-container-org84a9c02" class="outline-3">
<h3 id="org84a9c02">Code</h3>
<div class="outline-text-3" id="text-org84a9c02">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff0066;">def</span> <span style="color: #63de5d;">get_range</span><span style="color: #ab7eff;">(</span>task<span style="color: #ab7eff;">)</span>:
    <span style="color: #ffac4a;">a</span>, <span style="color: #ffac4a;">b</span> = <span style="color: #ab7eff;">[</span><span style="color: #ff0066;">int</span><span style="color: #06d8ff;">(</span>i<span style="color: #06d8ff;">)</span> <span style="color: #ff0066;">for</span> i <span style="color: #ff0066;">in</span> task.split<span style="color: #06d8ff;">(</span><span style="color: #E6DB74;">'-'</span><span style="color: #06d8ff;">)</span><span style="color: #ab7eff;">]</span>
    <span style="color: #ff0066;">return</span> <span style="color: #ff0066;">set</span><span style="color: #ab7eff;">(</span><span style="color: #ff0066;">range</span><span style="color: #06d8ff;">(</span>a, b + 1<span style="color: #06d8ff;">)</span><span style="color: #ab7eff;">)</span>

<span style="color: #ffac4a;">subsets</span> = 0
<span style="color: #ffac4a;">overlap</span> = 0
<span style="color: #ff0066;">for</span> line <span style="color: #ff0066;">in</span> data.split<span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">'\n'</span><span style="color: #ab7eff;">)</span>:
    <span style="color: #ffac4a;">a</span>, <span style="color: #ffac4a;">b</span> = line.split<span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">','</span><span style="color: #ab7eff;">)</span>
    <span style="color: #ffac4a;">a</span> = get_range<span style="color: #ab7eff;">(</span>a<span style="color: #ab7eff;">)</span>
    <span style="color: #ffac4a;">b</span> = get_range<span style="color: #ab7eff;">(</span>b<span style="color: #ab7eff;">)</span>
    <span style="color: #ffac4a;">subsets</span> += a.issubset<span style="color: #ab7eff;">(</span>b<span style="color: #ab7eff;">)</span> <span style="color: #ff0066;">or</span> b.issubset<span style="color: #ab7eff;">(</span>a<span style="color: #ab7eff;">)</span>
    <span style="color: #ffac4a;">overlap</span> += <span style="color: #ff0066;">len</span><span style="color: #ab7eff;">(</span>a.intersection<span style="color: #06d8ff;">(</span>b<span style="color: #06d8ff;">)</span><span style="color: #ab7eff;">)</span> &gt;= 1
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>subsets<span style="color: #ab7eff;">)</span>
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>overlap<span style="color: #ab7eff;">)</span>
</pre>
</div>

<pre class="example">
459
779
</pre>
</div>
</div>
</div>
<div id="outline-container-org7ea9b2f" class="outline-2">
<h2 id="org7ea9b2f">Day 5</h2>
<div class="outline-text-2" id="text-org7ea9b2f">
<p>
Lost to corrupted files :(
</p>
</div>
</div>
