index.html

<div id="outline-container-org950f911" class="outline-2">
<h2 id="org950f911"><a href="https://adventofcode.com/2022/day/6">Day 6</a></h2>
<div class="outline-text-2" id="text-org950f911">
</div>
<div id="outline-container-org7842970" class="outline-3">
<h3 id="org7842970">Code</h3>
<div class="outline-text-3" id="text-org7842970">
<div class="org-src-container">
<pre class="src src-python" id="org1149969"><span style="color: #ff0066;">for</span> line <span style="color: #ff0066;">in</span> data.split<span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">'\n'</span><span style="color: #ab7eff;">)</span>:  <span style="color: #bebebe;"># </span><span style="color: #bebebe;">Multiple lines for the example code testing</span>
    <span style="color: #ffac4a;">marker</span> = <span style="color: #ff0066;">list</span><span style="color: #ab7eff;">(</span>line<span style="color: #06d8ff;">[</span>:match - 1<span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">)</span>
    <span style="color: #ff0066;">for</span> i, char <span style="color: #ff0066;">in</span> <span style="color: #ff0066;">enumerate</span><span style="color: #ab7eff;">(</span>line<span style="color: #06d8ff;">[</span>match - 1:<span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">)</span>:
        marker.append<span style="color: #ab7eff;">(</span>char<span style="color: #ab7eff;">)</span>
        <span style="color: #ff0066;">if</span> <span style="color: #ff0066;">len</span><span style="color: #ab7eff;">(</span><span style="color: #ff0066;">set</span><span style="color: #06d8ff;">(</span>marker<span style="color: #06d8ff;">)</span><span style="color: #ab7eff;">)</span> == match:
            <span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>i + match<span style="color: #ab7eff;">)</span>
            <span style="color: #ff0066;">break</span>
        marker.pop<span style="color: #ab7eff;">(</span>0<span style="color: #ab7eff;">)</span>
</pre>
</div>

<pre class="example">
1953
</pre>


<pre class="example">
2301
</pre>
</div>
</div>
</div>
