aoc.org
** Code
#+begin_src python :results output :var data=DAY7_DATA :exports both
system = {'/': {'_files': []}}
path = []
sizes = {'/': 0}

def get_current_dir():
    result = system
    for p in path:
        result = result[p]
    return result

def add_size(file_size):
    i = path[0]
    sizes[i] += file_size
    for p in path[1:]:
        i += p + '/'
        if i not in sizes:
            sizes[i] = file_size
        else:
            sizes[i] += file_size

for line in data.split('\n'):
    line = line.split()
    if line[0] == '$':
        cmd = line[1]
        if cmd == 'cd':
            if line[2] == '..':
                path.pop()
            else:
                path.append(line[2])
        elif cmd == 'ls':
            continue
        else:
            print("Missing ", cmd)
    elif line[0] == 'dir':
        current = get_current_dir()
        if line[1] not in current:
            current[line[1]] = {'_files': []}
    else:
        # We are adding files now
        current = get_current_dir()
        current['_files'].append([int(line[0]), line[1]])
        add_size(int(line[0]))

def puzzle1():
    result = 0
    for key, size in sizes.items():
        if size <= 100000:
            result += size
    return result
print(puzzle1())

def puzzle2():
    max_file_system = 70000000
    needed_space = 30000000
    left_overspace = max_file_system - sizes['/']
    space_to_delete = needed_space - left_overspace
    return min(sizes.values(),
               key=lambda x: max_file_system if x < space_to_delete else \
               abs(x - space_to_delete))
print(puzzle2())
#+end_src

#+RESULTS:
: 1490523
: 12390492

