index.html

<div id="outline-container-org52e0d26" class="outline-2">
<h2 id="org52e0d26"><a href="https://adventofcode.com/2022/day/7">Day 7</a></h2>
<div class="outline-text-2" id="text-org52e0d26">
</div>
<div id="outline-container-org12bd043" class="outline-3">
<h3 id="org12bd043">Code</h3>
<div class="outline-text-3" id="text-org12bd043">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ffac4a;">system</span> = <span style="color: #ab7eff;">{</span><span style="color: #E6DB74;">'/'</span>: <span style="color: #06d8ff;">{</span><span style="color: #E6DB74;">'_files'</span>: <span style="color: #63de5d;">[]</span><span style="color: #06d8ff;">}</span><span style="color: #ab7eff;">}</span>
<span style="color: #ffac4a;">path</span> = <span style="color: #ab7eff;">[]</span>
<span style="color: #ffac4a;">sizes</span> = <span style="color: #ab7eff;">{</span><span style="color: #E6DB74;">'/'</span>: 0<span style="color: #ab7eff;">}</span>

<span style="color: #ff0066;">def</span> <span style="color: #63de5d;">get_current_dir</span><span style="color: #ab7eff;">()</span>:
    <span style="color: #ffac4a;">result</span> = system
    <span style="color: #ff0066;">for</span> p <span style="color: #ff0066;">in</span> <span style="color: #ffac4a;">path</span>:
        result = result<span style="color: #ab7eff;">[</span>p<span style="color: #ab7eff;">]</span>
    <span style="color: #ff0066;">return</span> result

<span style="color: #ff0066;">def</span> <span style="color: #63de5d;">add_size</span><span style="color: #ab7eff;">(</span>file_size<span style="color: #ab7eff;">)</span>:
    <span style="color: #ffac4a;">i</span> = path<span style="color: #ab7eff;">[</span>0<span style="color: #ab7eff;">]</span>
    <span style="color: #ffac4a;">sizes</span><span style="color: #ab7eff;">[</span><span style="color: #ffac4a;">i</span><span style="color: #ab7eff;">]</span> += file_size
    <span style="color: #ff0066;">for</span> p <span style="color: #ff0066;">in</span> <span style="color: #ffac4a;">path</span><span style="color: #ab7eff;">[</span>1:<span style="color: #ab7eff;">]</span>:
        i += p + <span style="color: #E6DB74;">'/'</span>
        <span style="color: #ff0066;">if</span> i <span style="color: #ff0066;">not</span> <span style="color: #ff0066;">in</span> <span style="color: #ffac4a;">sizes</span>:
            sizes<span style="color: #ab7eff;">[</span><span style="color: #ffac4a;">i</span><span style="color: #ab7eff;">]</span> = file_size
        <span style="color: #ff0066;">else</span>:
            sizes<span style="color: #ab7eff;">[</span><span style="color: #ffac4a;">i</span><span style="color: #ab7eff;">]</span> += file_size

<span style="color: #ff0066;">for</span> line <span style="color: #ff0066;">in</span> data.split<span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">'\n'</span><span style="color: #ab7eff;">)</span>:
    <span style="color: #ffac4a;">line</span> = line.split<span style="color: #ab7eff;">()</span>
    <span style="color: #ff0066;">if</span> line<span style="color: #ab7eff;">[</span>0<span style="color: #ab7eff;">]</span> == <span style="color: #E6DB74;">'$'</span>:
        cmd = line<span style="color: #ab7eff;">[</span>1<span style="color: #ab7eff;">]</span>
        <span style="color: #ff0066;">if</span> cmd == <span style="color: #E6DB74;">'cd'</span>:
            <span style="color: #ff0066;">if</span> line<span style="color: #ab7eff;">[</span>2<span style="color: #ab7eff;">]</span> == <span style="color: #E6DB74;">'..'</span>:
                path.pop<span style="color: #ab7eff;">()</span>
            <span style="color: #ff0066;">else</span>:
                path.append<span style="color: #ab7eff;">(</span>line<span style="color: #06d8ff;">[</span>2<span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">)</span>
        <span style="color: #ff0066;">elif</span> cmd == <span style="color: #E6DB74;">'ls'</span>:
            <span style="color: #ff0066;">continue</span>
        <span style="color: #ff0066;">else</span>:
            <span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span><span style="color: #E6DB74;">"Missing "</span>, cmd<span style="color: #ab7eff;">)</span>
    <span style="color: #ff0066;">elif</span> line<span style="color: #ab7eff;">[</span>0<span style="color: #ab7eff;">]</span> == <span style="color: #E6DB74;">'dir'</span>:
        current = get_current_dir<span style="color: #ab7eff;">()</span>
        <span style="color: #ff0066;">if</span> line<span style="color: #ab7eff;">[</span>1<span style="color: #ab7eff;">]</span> <span style="color: #ff0066;">not</span> <span style="color: #ff0066;">in</span> current:
            current<span style="color: #ab7eff;">[</span><span style="color: #ffac4a;">line</span><span style="color: #06d8ff;">[</span>1<span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">]</span> = <span style="color: #ab7eff;">{</span><span style="color: #E6DB74;">'_files'</span>: <span style="color: #06d8ff;">[]</span><span style="color: #ab7eff;">}</span>
    <span style="color: #ff0066;">else</span>:
        <span style="color: #bebebe;"># </span><span style="color: #bebebe;">We are adding files now</span>
        current = get_current_dir<span style="color: #ab7eff;">()</span>
        current<span style="color: #ab7eff;">[</span><span style="color: #E6DB74;">'_files'</span><span style="color: #ab7eff;">]</span>.append<span style="color: #ab7eff;">(</span><span style="color: #06d8ff;">[</span><span style="color: #ff0066;">int</span><span style="color: #63de5d;">(</span>line<span style="color: #ffac4a;">[</span>0<span style="color: #ffac4a;">]</span><span style="color: #63de5d;">)</span>, line<span style="color: #63de5d;">[</span>1<span style="color: #63de5d;">]</span><span style="color: #06d8ff;">]</span><span style="color: #ab7eff;">)</span>
        add_size<span style="color: #ab7eff;">(</span><span style="color: #ff0066;">int</span><span style="color: #06d8ff;">(</span>line<span style="color: #63de5d;">[</span>0<span style="color: #63de5d;">]</span><span style="color: #06d8ff;">)</span><span style="color: #ab7eff;">)</span>

<span style="color: #ff0066;">def</span> <span style="color: #63de5d;">puzzle1</span><span style="color: #ab7eff;">()</span>:
    result = 0
    <span style="color: #ff0066;">for</span> key, size <span style="color: #ff0066;">in</span> sizes.items<span style="color: #ab7eff;">()</span>:
        <span style="color: #ff0066;">if</span> size &lt;= 100000:
            result += size
    <span style="color: #ff0066;">return</span> result
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>puzzle1<span style="color: #06d8ff;">()</span><span style="color: #ab7eff;">)</span>

<span style="color: #ff0066;">def</span> <span style="color: #63de5d;">puzzle2</span><span style="color: #ab7eff;">()</span>:
    max_file_system = 70000000
    needed_space = 30000000
    left_overspace = max_file_system - sizes<span style="color: #ab7eff;">[</span><span style="color: #E6DB74;">'/'</span><span style="color: #ab7eff;">]</span>
    space_to_delete = needed_space - left_overspace
    <span style="color: #ff0066;">return</span> <span style="color: #ff0066;">min</span><span style="color: #ab7eff;">(</span>sizes.values<span style="color: #06d8ff;">()</span>,
               key=<span style="color: #ff0066;">lambda</span> x: max_file_system <span style="color: #ff0066;">if</span> x &lt; space_to_delete <span style="color: #ff0066;">else</span> \
               <span style="color: #ff0066;">abs</span><span style="color: #06d8ff;">(</span>x - space_to_delete<span style="color: #06d8ff;">)</span><span style="color: #ab7eff;">)</span>
<span style="color: #ff0066;">print</span><span style="color: #ab7eff;">(</span>puzzle2<span style="color: #06d8ff;">()</span><span style="color: #ab7eff;">)</span>
</pre>
</div>

<pre class="example">
1490523
12390492
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
